Repository: Enzo1603/nethz
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de

source: Activate your account
de: Aktiviere dein Konto

source: Email Address
de: E-Mail-Adresse

source: We'll never share your email address with anyone else.
de: Wir werden deine E-Mail-Adresse niemals mit anderen teilen.

source: Password
de: Passwort

source: Minimum length of 8 characters.
de: Mindestlänge von 8 Zeichen.

source: The username contains not allowed characters or expressions.
de: Der Benutzername enthält nicht erlaubte Zeichen oder Ausdrücke.

source: Username
de: Benutzername

source: Confirm Password
de: Passwort bestätigen

source: Sign up
de: Registrieren

source: Login
de: Anmelden

source: Forgot Password?
de: Passwort vergessen?

source: The two password entries do not match.
de: Die beiden Passworteingaben stimmen nicht überein.

source: Username and Email Address
de: Benutzername und E-Mail-Adresse

source: First and Last name
de: Vorname und Nachname

source: First Name
de: Vorname

source: Last Name
de: Nachname

source: Change Password
de: Passwort ändern

source: New Password
de: Neues Passwort

source: Confirm New Password
de: Neues Passwort bestätigen

source: Update
de: Aktualisieren

source: Reset my password
de: Mein Passwort zurücksetzen

source: Change my password
de: Mein Passwort ändern

source: username
de: Benutzername

source: Choose your unique username.
de: Wähle deinen einzigartigen Benutzernamen.

source: Enter a valid username. This username may contain only letters, numbers, and @/./+/-/_ characters.
de: Gib einen gültigen Benutzernamen ein. Dieser Benutzername darf nur Buchstaben, Zahlen und @/./+/-/_ Zeichen enthalten.

source: A user with that username already exists.
de: Ein Benutzer mit diesem Benutzernamen existiert bereits.

source: email address
de: E-Mail-Adresse

source: You're already logged in.
de: Du bist bereits angemeldet.

source: Account creation successful. A confirmation email has been sent to your email address.
de: Dein Konto wurde erfolgreich erstellt. Eine Bestätigungs-E-Mail wurde an deine E-Mail-Adresse gesendet.

source: You will not be able to log in until you have confirmed your email.
de: Du kannst dich nicht anmelden, bis du deine E-Mail bestätigt hast.

source: You successfully logged in.
de: Du hast dich erfolgreich angemeldet.

source: Another confirmation email has been sent to your email address since you have not confirmed it yet.
de: Da du deine E-Mail-Adresse noch nicht bestätigt hast, wurde eine weitere Bestätigungs-E-Mail an deine E-Mail-Adresse gesendet.

source: You successfully logged out.
de: Du hast dich erfolgreich abgemeldet.

source: Thank you for confirming your email. You can now log in to your account.
de: Vielen Dank für die Bestätigung deiner E-Mail. Du kannst dich jetzt anmelden.

source: Invalid confirmation link. Please make sure you are using the correct link provided in the confirmation email.
de: Ungültiger Bestätigungslink. Stelle sicher, dass du den korrekten Link aus der Bestätigungs-E-Mail verwendest.

source: Your password has been updated.
de: Dein Passwort wurde aktualisiert.

source: Your email has been updated. A confirmation link has been sent to your new email address. Please confirm your email to log in.
de: Deine E-Mail-Adresse wurde aktualisiert. Ein Bestätigungslink wurde an deine neue E-Mail-Adresse gesendet. Bitte bestätige deine E-Mail, um dich anzumelden.

source: Your data has been successfully updated.
de: Deine Daten wurden erfolgreich aktualisiert.

source: You're already logged in. You can change your password in your account settings.
de: Du bist bereits angemeldet. Du kannst dein Passwort in deinen Kontoeinstellungen ändern.

source: If your email address is linked to an account, a password reset link has been sent to it.
de: Wenn deine E-Mail-Adresse mit einem Konto verknüpft ist, ist ein Link zum Zurücksetzen des Passworts an dich gesendet worden.

source: The password reset link is invalid, possibly because it has already been used. Please request a new password reset.
de: Der Link zum Zurücksetzen des Passworts ist ungültig, möglicherweise weil er bereits verwendet worden ist. Bitte fordere einen neuen Link zum Zurücksetzen deines Passworts an.

source: Your password has been successfully reset. You can now log in with your new password.
de: Dein Passwort wurde erfolgreich zurückgesetzt. Du kannst dich jetzt mit deinem neuen Passwort anmelden.

source: Worldwide
de: Weltweit

source: Africa
de: Afrika

source: Americas
de: Amerika

source: Asia
de: Asien

source: Europe
de: Europa

source: Oceania
de: Ozeanien

source: Antarctic
de: Antarktik

source: Engineering mechanics study materials and geography games for ETH students
de: Technische Mechanik Studienmaterialien und Geografie-Spiele für ETH Studierende

source: Enzo Baraldi, ETH Zurich, ETHZ, engineering mechanics, technische mechanik, worldle, geography, study materials
de: Enzo Baraldi, ETH Zürich, ETHZ, engineering mechanics, technische mechanik, worldle, geography, study materials

source: Engineering Mechanics {}
de: Technische Mechanik {}

source: Engineering mechanics study materials and solutions for ETH students
de: Technische Mechanik Studienmaterialien und Lösungen für ETH Studierende

source: Enzo Baraldi, technische mechanik, engineering mechanics, ETH Zurich, ETHZ, study materials
de: Enzo Baraldi, technische mechanik, engineering mechanics, ETH Zürich, ETHZ, Studienmaterialien

source: Engineering Mechanics
de: Technische Mechanik

source: Geography games - guess capitals, languages, currencies and countries
de: Geografie-Spiele - Hauptstädte, Sprachen, Währungen und Länder erraten

source: worldle, geography, capitals, languages, currencies, quiz, game
de: Worldle, Geografie, Hauptstädte, Sprachen, Währungen, Quiz, Spiel

source: Geography quiz game - guess the capitals
de: Geografie-Spiel - Hauptstädte erraten

source: capitals, geography, worldle, quiz, game
de: Hauptstädte, Geografie, Worldle, Quiz, Spiel

source: Geography quiz game - guess the languages
de: Geografie-Spiel - Sprachen erraten

source: languages, geography, worldle, quiz, game
de: Sprachen, Geografie, Worldle, Quiz, Spiel

source: Competitive geography quiz with leaderboards
de: Wettbewerbsgeografie-Spiel mit Ranglisten

source: worldle, geography, competitive, quiz, leaderboard
de: Worldle, Geografie, Wettbewerb, Quiz, Rangliste

source: Worldle Leaderboards
de: Worldle-Ranglisten

source: View top players in geography quiz games
de: Top-Spieler in Geografie-Spielen anzeigen

source: leaderboards, worldle, geography, quiz, rankings
de: Ranglisten, Worldle, Geografie, Quiz, Ranglisten

source: Engineering mechanics study materials and geography games for ETH Zurich students
de: Technische Mechanik Studienmaterialien und Geografie-Spiele für ETH Zürich Studierende

source: ETH Zurich, engineering mechanics, worldle, geography, study materials
de: ETH Zürich, Technische Mechanik, Worldle, Geografie, Studienmaterialien

source: Engineering mechanics study materials and solutions for ETH Zurich students
de: Technische Mechanik Studienmaterialien und Lösungen für ETH Zürich Studierende

source: engineering mechanics, ETH Zurich, study materials, engineering
de: Technische Mechanik, ETH Zürich, Studienmaterialien, Ingenieurwesen

source: Coming soon (or never)
de: Demnächst (oder nie)

source: nothing to be seen here
de: hier gibt es nichts zu sehen

source: Go away
de: Geh weg

source: Short name for the exercise session
de: Kurzname für die Übungsstunde

source: Short name for the exercise session (e.g. TM_HS24).
de: Kurzname für die Übungsstunde (z. B. TM_HS24).

source: Name of the exercise session
de: Name der Übungsstunde

source: Name of the exercise session (e.g. Engineering Mechanics HS24).
de: Name der Übungsstunde (z. B. Technische Mechanik HS24).

source: Exercise Session
de: Übungsstunde

source: Exercise Sessions
de: Übungsstunden

source: The exercise session for this week entry belongs to.
de: Die Übungsstunde für diesen Wochen-Eintrag gehört dazu.

source: Week Number
de: Wochennummer

source: The week number for this entry.
de: Die Wochennummer für diesen Eintrag.

source: Materials Number
de: Unterlagennummer

source: The materials number for this entry.
de: Die Unterlagennummer für diesen Eintrag.

source: Link to the exercise materials
de: Link zu den Übungsmaterialien

source: Link to the exercise materials for the week.
de: Link zu den Übungsmaterialien für die Woche.

source: Remarks
de: Anmerkungen

source: You can enter notes and remarks here. HTML is allowed.
de: Du kannst hier Notizen und Anmerkungen eingeben. HTML ist erlaubt.

source: Week Entry
de: Wochen-Eintrag

source: Week Entries
de: Wochen-Einträge

source: To the documents
de: Zu den Unterlagen

source: Computer Science I 2024
de: Informatik I 2024

source: Various country quizzes
de: Verschiedene Länderquizzes

source: To the game modes
de: Zu den Spielmodi

source: You have to confirm your email address to log in.
de: Du musst deine E-Mail-Adresse bestätigen, um dich anzumelden.

source: Don't have an account yet?
de: Noch kein Konto?

source: Password reset
de: Passwort zurücksetzen

source: Hello
de: Hallo

source: You're receiving this email because you requested a password reset for your user account at
de: Du erhältst diese E-Mail, weil du eine Passwortzurücksetzung für dein Benutzerkonto angefordert hast auf

source: Please go to the following page and choose a new password
de: Bitte gehe zur folgenden Seite und setze ein neues Passwort

source: If you are having trouble with the button, you can also reset your password by copying and pasting the following link into your browser
de: Wenn du Probleme mit dem Button hast, kannst du dein Passwort auch zurücksetzen, indem du den folgenden Link in deinen Browser kopierst

source: Accidentally here?
de: Aus Versehen hier?

source: Password reset request for your account
de: Passwort zurücksetzen

source: Sign Up
de: Registrieren

source: Already have an account?
de: Hast du bereits ein Konto?

source: My Account
de: Mein Konto

source: Email Confirmation
de: E-Mail-Bestätigung

source: Please click the link below to confirm your email address and activate your account
de: Bitte klicke auf den Link unten, um deine E-Mail-Adresse zu bestätigen und dein Konto zu aktivieren.

source: Activate my account
de: Mein Konto aktivieren

source: If you are having trouble with the button, you can also confirm your email by copying and pasting the following link into your browser
de: Wenn du Probleme mit dem Button hast, kannst du deine E-Mail-Adresse auch bestätigen, indem du den folgenden Link in deinen Browser kopierst

source: Oops! You ran out of oxygen.
de: Uups! Du hast keinen Sauerstoff mehr.

source: The page you're looking for is now beyond your reach...
de: Die Seite, die du suchst, ist jetzt ausserhalb deiner Reichweite...

source: Return Home
de: Zur Startseite

source: Logout
de: Abmelden

source: To the Polybox
de: Zur Polybox

source: Useful Links
de: Nützliche Links

source: Theory Recap by Felix Stalder
de: Theorieblätter von Felix Stalder

source: YT - EE4ETH - Engineering Mechanics Playlist
de: YT - EE4ETH - Technische Mechanik Playlist

source: Week
de: Woche

source: Exercise Materials
de: Übungsmaterialien

source: Exercises
de: Serien

source: Solutions
de: Lösungen

source: Exercise Material
de: Übungsmaterial

source: Go to Game
de: Zum Spiel

source: «Community Solutions» by AMIV
de: «Community Solutions» des AMIV

source: AMIV new Study Documents
de: AMIV neue Studienunterlagen

source: AMIV old Study Documents
de: AMIV alte Studienunterlagen

source: Polybox with additional ITET exams (especially useful for EM in 4th semester)
de: Polybox mit zusätzlichen ITET-Prüfungen (besonders nützlich für EM im 4. Semester)

source: YouTube Channel - EE4ETH
de: YouTube-Kanal - EE4ETH

source: Enter the capital(s)
de: Trage die Hauptstadt oder die Hauptstädte ein

source: Check Answer
de: Antwort überprüfen

source: Show me the solution
de: Zeige mir die Lösung

source: Is the area of the country on the right higher or lower?
de: Ist die Fläche des Landes auf der rechten Seite grösser oder kleiner?

source: Lower
de: Kleiner

source: Higher
de: Grösser

source: Leaderboard
de: Rangliste

source: To make this game more challenging, hints to the country in the currency's name are replaced by an asterisk.
de: Um dieses Spiel herausfordernder zu gestalten, werden Hinweise auf das Land im Namen der Währung durch ein Sternchen ersetzt.

source: Please note that the games themselves will continue to be in English.
de: Beachte, dass die Spiele selbst weiterhin auf Englisch sind.

source: Game Modes
de: Spielmodi

source: Practice (no account required)
de: Üben (kein Konto erforderlich)

source: Competitive (account required)
de: Wettbewerb (Konto erforderlich)

source: Leaderboards
de: Ranglisten

source: Enter the language(s)
de: Trage die Sprache(n) ein

source: Guess the capitals
de: Errate die Hauptstädte

source: Play
de: Spielen

source: Guess the national languages
de: Errate die Landessprachen

source: Higher Lower with country areas
de: Higher-Lower mit Landesflächen

source: Guess the currency
de: Errate die Währung
